DataProcessors/ФормированиеПрайсЛистаТТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеПрайсЛистаТТ</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТорговыеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ДвиженияТоваровПоЛистамУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияТоваровПоЛистамУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиницаПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвиженияТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияТовараПоЛистуУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ТоварныйАссортиментТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТоварныйАссортиментТочек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выведена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрещена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>id_TT</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзПотерянных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыРозничныхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыРозничныхТочек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Избенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перекресток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Микромаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятерочка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПространствоВкуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вкусомат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тилси</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетПлейс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидДвиженияТовараПоЛистуУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидДвиженияТовараПоЛистуУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПоКачеству</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дегустация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоСДругойТТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоНаДругуюТТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеБезВозвратаНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплектация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ФормированиеПрайсЛистаТТ/Forms/Форма/Ext/Form/Module.bsl
Функция СформироватьПрайсыДляТочек()
	
	Макет = Обработки.ФормированиеПрайсЛистаТТ.ПолучитьМакет("Прайс");
	МассивТабДок = Новый Массив();
	ЗапросТТ = Новый Запрос();
	ЗапросТТ.УстановитьПараметр("ТТ", Объект.ТорговыеТочки.Выгрузить().ВыгрузитьКолонку("ТТ"));
	ЗапросТТ.УстановитьПараметр("ЕстьОтборПоТТ", Объект.ТорговыеТочки.Количество() > 0);
	ЗапросТТ.Текст = "ВЫБРАТЬ
	                 |	СтруктурныеЕдиницы.Ссылка
	                 |ИЗ
	                 |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	                 |ГДЕ
	                 |	(СтруктурныеЕдиницы.Ссылка В (&ТТ)
	                 |			ИЛИ &ЕстьОтборПоТТ = ЛОЖЬ)
	                 |	И СтруктурныеЕдиницы.ТипРозничнойТочки = ЗНАЧЕНИЕ(Перечисление.ТипыРозничныхТочек.Избенка)
	                 |	И (СтруктурныеЕдиницы.Активное = ИСТИНА
	                 |			ИЛИ &ЕстьОтборПоТТ = ИСТИНА)
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	СтруктурныеЕдиницы.НомерТочки";
					 
	ВыборкаТТ = ЗапросТТ.Выполнить().Выбрать();
	Пока ВыборкаТТ.Следующий() Цикл
		ТабДокумент = Новый ТабличныйДокумент();
		
		ЗапросТовары = Новый Запрос();
		ЗапросТовары.УстановитьПараметр("ДатаПрайса", ТекущаяДата() + 3*86400);
		ЗапросТовары.УстановитьПараметр("ТТ", ВыборкаТТ.Ссылка);
		ЗапросТовары.УстановитьПараметр("Группы", Объект.ГруппыТоваров.Выгрузить().ВыгрузитьКолонку("Группа"));
		ЗапросТовары.УстановитьПараметр("ЕстьОтборПоГруппам", Объект.ГруппыТоваров.Количество() > 0);
		ЗапросТовары.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                     |	ДвиженияТоваровПоЛистамУчетаОбороты.Номенклатура
		                     |ПОМЕСТИТЬ ВТ_Движения
		                     |ИЗ
		                     |	РегистрНакопления.ДвиженияТоваровПоЛистамУчета.Обороты(
		                     |			ДОБАВИТЬКДАТЕ(&ДатаПрайса, МЕСЯЦ, -3),
		                     |			&ДатаПрайса,
		                     |			,
		                     |			СтруктурнаяЕдиница = &ТТ
		                     |				И ВидДвиженияТовара В (ЗНАЧЕНИЕ(Перечисление.ВидДвиженияТовараПоЛистуУчета.Продажа), ЗНАЧЕНИЕ(Перечисление.ВидДвиженияТовараПоЛистуУчета.Поступление))) КАК ДвиженияТоваровПоЛистамУчетаОбороты
		                     |ГДЕ
		                     |	(ДвиженияТоваровПоЛистамУчетаОбороты.Номенклатура В ИЕРАРХИИ (&Группы)
		                     |			ИЛИ &ЕстьОтборПоГруппам = ЛОЖЬ)
		                     |;
		                     |
		                     |////////////////////////////////////////////////////////////////////////////////
		                     |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                     |	ТоварныйАссортиментТочекСрезПоследних.Номенклатура
		                     |ПОМЕСТИТЬ ВТ_Ассортимент
		                     |ИЗ
		                     |	РегистрСведений.ТоварныйАссортиментТочек.СрезПоследних(
		                     |			&ДатаПрайса,
		                     |			ТорговаяТочка = &ТТ
		                     |				И (Номенклатура В ИЕРАРХИИ (&Группы)
		                     |					ИЛИ &ЕстьОтборПоГруппам = ЛОЖЬ)) КАК ТоварныйАссортиментТочекСрезПоследних
		                     |ГДЕ
		                     |	ТоварныйАссортиментТочекСрезПоследних.Выведена = ЛОЖЬ
		                     |;
		                     |
		                     |////////////////////////////////////////////////////////////////////////////////
		                     |ВЫБРАТЬ
		                     |	ТоварныйАссортиментТочекСрезПоследних.Номенклатура,
		                     |	ТоварныйАссортиментТочекСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдИзм,
		                     |	ТоварныйАссортиментТочекСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков.Вес КАК Вес,
		                     |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		                     |	ВЫБОР
		                     |		КОГДА ТоварныйАссортиментТочекСрезПоследних.Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		                     |			ТОГДА ТоварныйАссортиментТочекСрезПоследних.Номенклатура.Родитель.Родитель.Родитель
		                     |		КОГДА ТоварныйАссортиментТочекСрезПоследних.Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		                     |			ТОГДА ТоварныйАссортиментТочекСрезПоследних.Номенклатура.Родитель.Родитель
		                     |		КОГДА ТоварныйАссортиментТочекСрезПоследних.Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		                     |			ТОГДА ТоварныйАссортиментТочекСрезПоследних.Номенклатура.Родитель
		                     |		ИНАЧЕ ТоварныйАссортиментТочекСрезПоследних.Номенклатура.Родитель
		                     |	КОНЕЦ КАК Родитель
		                     |ИЗ
		                     |	(ВЫБРАТЬ
		                     |		ТоварныйАссортиментТочекСрезПоследних.Номенклатура КАК Номенклатура
		                     |	ИЗ
		                     |		ВТ_Ассортимент КАК ТоварныйАссортиментТочекСрезПоследних
		                     |	
		                     |	ОБЪЕДИНИТЬ ВСЕ
		                     |	
		                     |	ВЫБРАТЬ
		                     |		ВТ_Движения.Номенклатура
		                     |	ИЗ
		                     |		ВТ_Движения КАК ВТ_Движения) КАК ТоварныйАссортиментТочекСрезПоследних
		                     |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                     |				&ДатаПрайса,
		                     |				ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродаж)
		                     |					И ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК ЦеныНоменклатурыСрезПоследних
		                     |		ПО ТоварныйАссортиментТочекСрезПоследних.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		                     |ГДЕ
		                     |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) <> 0
		                     |
		                     |УПОРЯДОЧИТЬ ПО
		                     |	Родитель,
		                     |	ТоварныйАссортиментТочекСрезПоследних.Номенклатура.Наименование";
							 
		ВыборкаТовары = ЗапросТовары.Выполнить().Выбрать();
		Пока ВыборкаТовары.СледующийПоЗначениюПоля("Родитель") Цикл
			ТекСтрока  = 1;
			Если ТабДокумент.ВысотаТаблицы > 0 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			Область = Макет.ПолучитьОбласть("Шапка");
			Область.Параметры.Дата = ТекущаяДата();
			Область.Параметры.ИмяТТ = ВыборкаТТ.Ссылка;
			ТабДокумент.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("Группа");
			Область.Параметры.Группа = ВыборкаТовары.Родитель;
			ТабДокумент.Вывести(Область);
			Пока ВыборкаТовары.СледующийПоЗначениюПоля("Номенклатура") Цикл
				Область = Макет.ПолучитьОбласть("Строка");
				Область.Параметры.НомерПП = ТекСтрока;
				Область.Параметры.Наименование = ВыборкаТовары.Номенклатура;
				Область.Параметры.Вес = Формат(ВыборкаТовары.Вес, "ЧДЦ=3; ЧГ=0");
				Область.Параметры.Упаковка = НРег(ВыборкаТовары.ЕдИзм);
				Область.Параметры.Цена = ВыборкаТовары.Цена;
				ТабДокумент.Вывести(Область);
				ТекСтрока = ТекСтрока + 1;
			КонецЦикла;
		КонецЦикла;	
		
		МассивТабДок.Добавить(Новый Структура("ТТ, ТабДокумент", ВыборкаТТ.Ссылка, ТабДокумент));
	КонецЦикла;
	
	Возврат МассивТабДок;
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Объект.ТорговыеТочки.Количество() = 0 Тогда
		Предупреждение("Формировать прайсы по всем точкам можно только в файлы");
		Возврат;
	КонецЕсли;	
	
	ТабДокументы = СформироватьПрайсыДляТочек();
	Для Каждого ПрайсЭлемент Из ТабДокументы Цикл
		ПрайсЭлемент.ТабДокумент.ОтображатьЗаголовки = Ложь;
		ПрайсЭлемент.ТабДокумент.ОтображатьСетку = Ложь;
		ПрайсЭлемент.ТабДокумент.Показать(ПрайсЭлемент.ТТ);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВФайлы(Команда)
	
	ДиалогВыб = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ДиалогВыб.Выбрать() Тогда
		ТабДокументы = СформироватьПрайсыДляТочек();
		Для Каждого ПрайсЭлемент Из ТабДокументы Цикл
			ИмяТТДляФайла = СтрЗаменить(ПрайсЭлемент.ТТ, "\", "");
			ИмяТТДляФайла = СтрЗаменить(ИмяТТДляФайла, "/", "");
			ПрайсЭлемент.ТабДокумент.Записать(ДиалогВыб.Каталог + "\" + ИмяТТДляФайла + ".pdf", ТипФайлаТабличногоДокумента.PDF);
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры
